program(1.3)
[buildInfo = dict<string, string>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3500.32.1"}})]
{
    func main<ios18>(tensor<int32, [?, ?]> attention_mask, tensor<int32, [?, ?]> input_ids) [FlexibleShapeInformation = tuple<tuple<string, dict<string, tensor<int32, [?]>>>, tuple<string, dict<string, list<tensor<int32, [2]>, ?>>>>((("DefaultShapes", {{"attention_mask", [1, 32]}, {"input_ids", [1, 32]}}), ("RangeDims", {{"attention_mask", [[1, 64], [32, 512]]}, {"input_ids", [[1, 64], [32, 512]]}})))] {
            tensor<int32, [1, 512]> model_embeddings_token_type_ids = const()[name = string("model_embeddings_token_type_ids"), val = tensor<int32, [1, 512]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(64)))];
            tensor<int32, [1, 512]> model_embeddings_position_ids = const()[name = string("model_embeddings_position_ids"), val = tensor<int32, [1, 512]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(2176)))];
            tensor<fp32, [30522, 384]> model_embeddings_word_embeddings_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [30522, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(4288))), scale = tensor<fp32, [30522, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(11724800))))[name = string("model_embeddings_word_embeddings_weight_quantized")];
            tensor<fp32, [2, 384]> model_embeddings_token_type_embeddings_weight = const()[name = string("model_embeddings_token_type_embeddings_weight"), val = tensor<fp32, [2, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(11846976)))];
            tensor<fp32, [512, 384]> model_embeddings_position_embeddings_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [512, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(11850112))), scale = tensor<fp32, [512, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12046784))))[name = string("model_embeddings_position_embeddings_weight_quantized")];
            tensor<fp32, [384]> model_embeddings_LayerNorm_bias = const()[name = string("model_embeddings_LayerNorm_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12048896)))];
            tensor<fp32, [384]> model_embeddings_LayerNorm_weight = const()[name = string("model_embeddings_LayerNorm_weight"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12050496)))];
            tensor<fp32, [384]> model_encoder_layer_0_attention_self_query_bias = const()[name = string("model_encoder_layer_0_attention_self_query_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12052096)))];
            tensor<fp32, [384, 384]> model_encoder_layer_0_attention_self_query_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12053696))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12201216))))[name = string("model_encoder_layer_0_attention_self_query_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_0_attention_self_key_bias = const()[name = string("model_encoder_layer_0_attention_self_key_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12202816)))];
            tensor<fp32, [384, 384]> model_encoder_layer_0_attention_self_key_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12204416))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12351936))))[name = string("model_encoder_layer_0_attention_self_key_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_0_attention_self_value_bias = const()[name = string("model_encoder_layer_0_attention_self_value_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12353536)))];
            tensor<fp32, [384, 384]> model_encoder_layer_0_attention_self_value_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12355136))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12502656))))[name = string("model_encoder_layer_0_attention_self_value_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_0_attention_output_dense_bias = const()[name = string("model_encoder_layer_0_attention_output_dense_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12504256)))];
            tensor<fp32, [384, 384]> model_encoder_layer_0_attention_output_dense_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12505856))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12653376))))[name = string("model_encoder_layer_0_attention_output_dense_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_0_attention_output_LayerNorm_bias = const()[name = string("model_encoder_layer_0_attention_output_LayerNorm_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12654976)))];
            tensor<fp32, [384]> model_encoder_layer_0_attention_output_LayerNorm_weight = const()[name = string("model_encoder_layer_0_attention_output_LayerNorm_weight"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12656576)))];
            tensor<fp32, [1536]> model_encoder_layer_0_intermediate_dense_bias = const()[name = string("model_encoder_layer_0_intermediate_dense_bias"), val = tensor<fp32, [1536]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12658176)))];
            tensor<fp32, [1536, 384]> model_encoder_layer_0_intermediate_dense_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [1536, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(12664384))), scale = tensor<fp32, [1536, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(13254272))))[name = string("model_encoder_layer_0_intermediate_dense_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_0_output_dense_bias = const()[name = string("model_encoder_layer_0_output_dense_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(13260480)))];
            tensor<fp32, [384, 1536]> model_encoder_layer_0_output_dense_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 1536]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(13262080))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(13851968))))[name = string("model_encoder_layer_0_output_dense_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_0_output_LayerNorm_bias = const()[name = string("model_encoder_layer_0_output_LayerNorm_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(13853568)))];
            tensor<fp32, [384]> model_encoder_layer_0_output_LayerNorm_weight = const()[name = string("model_encoder_layer_0_output_LayerNorm_weight"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(13855168)))];
            tensor<fp32, [384]> model_encoder_layer_1_attention_self_query_bias = const()[name = string("model_encoder_layer_1_attention_self_query_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(13856768)))];
            tensor<fp32, [384, 384]> model_encoder_layer_1_attention_self_query_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(13858368))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(14005888))))[name = string("model_encoder_layer_1_attention_self_query_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_1_attention_self_key_bias = const()[name = string("model_encoder_layer_1_attention_self_key_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(14007488)))];
            tensor<fp32, [384, 384]> model_encoder_layer_1_attention_self_key_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(14009088))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(14156608))))[name = string("model_encoder_layer_1_attention_self_key_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_1_attention_self_value_bias = const()[name = string("model_encoder_layer_1_attention_self_value_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(14158208)))];
            tensor<fp32, [384, 384]> model_encoder_layer_1_attention_self_value_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(14159808))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(14307328))))[name = string("model_encoder_layer_1_attention_self_value_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_1_attention_output_dense_bias = const()[name = string("model_encoder_layer_1_attention_output_dense_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(14308928)))];
            tensor<fp32, [384, 384]> model_encoder_layer_1_attention_output_dense_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(14310528))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(14458048))))[name = string("model_encoder_layer_1_attention_output_dense_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_1_attention_output_LayerNorm_bias = const()[name = string("model_encoder_layer_1_attention_output_LayerNorm_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(14459648)))];
            tensor<fp32, [384]> model_encoder_layer_1_attention_output_LayerNorm_weight = const()[name = string("model_encoder_layer_1_attention_output_LayerNorm_weight"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(14461248)))];
            tensor<fp32, [1536]> model_encoder_layer_1_intermediate_dense_bias = const()[name = string("model_encoder_layer_1_intermediate_dense_bias"), val = tensor<fp32, [1536]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(14462848)))];
            tensor<fp32, [1536, 384]> model_encoder_layer_1_intermediate_dense_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [1536, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(14469056))), scale = tensor<fp32, [1536, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(15058944))))[name = string("model_encoder_layer_1_intermediate_dense_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_1_output_dense_bias = const()[name = string("model_encoder_layer_1_output_dense_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(15065152)))];
            tensor<fp32, [384, 1536]> model_encoder_layer_1_output_dense_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 1536]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(15066752))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(15656640))))[name = string("model_encoder_layer_1_output_dense_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_1_output_LayerNorm_bias = const()[name = string("model_encoder_layer_1_output_LayerNorm_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(15658240)))];
            tensor<fp32, [384]> model_encoder_layer_1_output_LayerNorm_weight = const()[name = string("model_encoder_layer_1_output_LayerNorm_weight"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(15659840)))];
            tensor<fp32, [384]> model_encoder_layer_2_attention_self_query_bias = const()[name = string("model_encoder_layer_2_attention_self_query_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(15661440)))];
            tensor<fp32, [384, 384]> model_encoder_layer_2_attention_self_query_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(15663040))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(15810560))))[name = string("model_encoder_layer_2_attention_self_query_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_2_attention_self_key_bias = const()[name = string("model_encoder_layer_2_attention_self_key_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(15812160)))];
            tensor<fp32, [384, 384]> model_encoder_layer_2_attention_self_key_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(15813760))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(15961280))))[name = string("model_encoder_layer_2_attention_self_key_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_2_attention_self_value_bias = const()[name = string("model_encoder_layer_2_attention_self_value_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(15962880)))];
            tensor<fp32, [384, 384]> model_encoder_layer_2_attention_self_value_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(15964480))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(16112000))))[name = string("model_encoder_layer_2_attention_self_value_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_2_attention_output_dense_bias = const()[name = string("model_encoder_layer_2_attention_output_dense_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(16113600)))];
            tensor<fp32, [384, 384]> model_encoder_layer_2_attention_output_dense_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(16115200))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(16262720))))[name = string("model_encoder_layer_2_attention_output_dense_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_2_attention_output_LayerNorm_bias = const()[name = string("model_encoder_layer_2_attention_output_LayerNorm_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(16264320)))];
            tensor<fp32, [384]> model_encoder_layer_2_attention_output_LayerNorm_weight = const()[name = string("model_encoder_layer_2_attention_output_LayerNorm_weight"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(16265920)))];
            tensor<fp32, [1536]> model_encoder_layer_2_intermediate_dense_bias = const()[name = string("model_encoder_layer_2_intermediate_dense_bias"), val = tensor<fp32, [1536]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(16267520)))];
            tensor<fp32, [1536, 384]> model_encoder_layer_2_intermediate_dense_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [1536, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(16273728))), scale = tensor<fp32, [1536, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(16863616))))[name = string("model_encoder_layer_2_intermediate_dense_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_2_output_dense_bias = const()[name = string("model_encoder_layer_2_output_dense_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(16869824)))];
            tensor<fp32, [384, 1536]> model_encoder_layer_2_output_dense_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 1536]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(16871424))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(17461312))))[name = string("model_encoder_layer_2_output_dense_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_2_output_LayerNorm_bias = const()[name = string("model_encoder_layer_2_output_LayerNorm_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(17462912)))];
            tensor<fp32, [384]> model_encoder_layer_2_output_LayerNorm_weight = const()[name = string("model_encoder_layer_2_output_LayerNorm_weight"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(17464512)))];
            tensor<fp32, [384]> model_encoder_layer_3_attention_self_query_bias = const()[name = string("model_encoder_layer_3_attention_self_query_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(17466112)))];
            tensor<fp32, [384, 384]> model_encoder_layer_3_attention_self_query_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(17467712))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(17615232))))[name = string("model_encoder_layer_3_attention_self_query_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_3_attention_self_key_bias = const()[name = string("model_encoder_layer_3_attention_self_key_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(17616832)))];
            tensor<fp32, [384, 384]> model_encoder_layer_3_attention_self_key_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(17618432))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(17765952))))[name = string("model_encoder_layer_3_attention_self_key_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_3_attention_self_value_bias = const()[name = string("model_encoder_layer_3_attention_self_value_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(17767552)))];
            tensor<fp32, [384, 384]> model_encoder_layer_3_attention_self_value_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(17769152))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(17916672))))[name = string("model_encoder_layer_3_attention_self_value_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_3_attention_output_dense_bias = const()[name = string("model_encoder_layer_3_attention_output_dense_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(17918272)))];
            tensor<fp32, [384, 384]> model_encoder_layer_3_attention_output_dense_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(17919872))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(18067392))))[name = string("model_encoder_layer_3_attention_output_dense_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_3_attention_output_LayerNorm_bias = const()[name = string("model_encoder_layer_3_attention_output_LayerNorm_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(18068992)))];
            tensor<fp32, [384]> model_encoder_layer_3_attention_output_LayerNorm_weight = const()[name = string("model_encoder_layer_3_attention_output_LayerNorm_weight"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(18070592)))];
            tensor<fp32, [1536]> model_encoder_layer_3_intermediate_dense_bias = const()[name = string("model_encoder_layer_3_intermediate_dense_bias"), val = tensor<fp32, [1536]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(18072192)))];
            tensor<fp32, [1536, 384]> model_encoder_layer_3_intermediate_dense_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [1536, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(18078400))), scale = tensor<fp32, [1536, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(18668288))))[name = string("model_encoder_layer_3_intermediate_dense_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_3_output_dense_bias = const()[name = string("model_encoder_layer_3_output_dense_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(18674496)))];
            tensor<fp32, [384, 1536]> model_encoder_layer_3_output_dense_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 1536]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(18676096))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(19265984))))[name = string("model_encoder_layer_3_output_dense_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_3_output_LayerNorm_bias = const()[name = string("model_encoder_layer_3_output_LayerNorm_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(19267584)))];
            tensor<fp32, [384]> model_encoder_layer_3_output_LayerNorm_weight = const()[name = string("model_encoder_layer_3_output_LayerNorm_weight"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(19269184)))];
            tensor<fp32, [384]> model_encoder_layer_4_attention_self_query_bias = const()[name = string("model_encoder_layer_4_attention_self_query_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(19270784)))];
            tensor<fp32, [384, 384]> model_encoder_layer_4_attention_self_query_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(19272384))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(19419904))))[name = string("model_encoder_layer_4_attention_self_query_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_4_attention_self_key_bias = const()[name = string("model_encoder_layer_4_attention_self_key_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(19421504)))];
            tensor<fp32, [384, 384]> model_encoder_layer_4_attention_self_key_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(19423104))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(19570624))))[name = string("model_encoder_layer_4_attention_self_key_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_4_attention_self_value_bias = const()[name = string("model_encoder_layer_4_attention_self_value_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(19572224)))];
            tensor<fp32, [384, 384]> model_encoder_layer_4_attention_self_value_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(19573824))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(19721344))))[name = string("model_encoder_layer_4_attention_self_value_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_4_attention_output_dense_bias = const()[name = string("model_encoder_layer_4_attention_output_dense_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(19722944)))];
            tensor<fp32, [384, 384]> model_encoder_layer_4_attention_output_dense_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(19724544))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(19872064))))[name = string("model_encoder_layer_4_attention_output_dense_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_4_attention_output_LayerNorm_bias = const()[name = string("model_encoder_layer_4_attention_output_LayerNorm_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(19873664)))];
            tensor<fp32, [384]> model_encoder_layer_4_attention_output_LayerNorm_weight = const()[name = string("model_encoder_layer_4_attention_output_LayerNorm_weight"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(19875264)))];
            tensor<fp32, [1536]> model_encoder_layer_4_intermediate_dense_bias = const()[name = string("model_encoder_layer_4_intermediate_dense_bias"), val = tensor<fp32, [1536]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(19876864)))];
            tensor<fp32, [1536, 384]> model_encoder_layer_4_intermediate_dense_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [1536, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(19883072))), scale = tensor<fp32, [1536, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(20472960))))[name = string("model_encoder_layer_4_intermediate_dense_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_4_output_dense_bias = const()[name = string("model_encoder_layer_4_output_dense_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(20479168)))];
            tensor<fp32, [384, 1536]> model_encoder_layer_4_output_dense_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 1536]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(20480768))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(21070656))))[name = string("model_encoder_layer_4_output_dense_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_4_output_LayerNorm_bias = const()[name = string("model_encoder_layer_4_output_LayerNorm_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(21072256)))];
            tensor<fp32, [384]> model_encoder_layer_4_output_LayerNorm_weight = const()[name = string("model_encoder_layer_4_output_LayerNorm_weight"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(21073856)))];
            tensor<fp32, [384]> model_encoder_layer_5_attention_self_query_bias = const()[name = string("model_encoder_layer_5_attention_self_query_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(21075456)))];
            tensor<fp32, [384, 384]> model_encoder_layer_5_attention_self_query_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(21077056))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(21224576))))[name = string("model_encoder_layer_5_attention_self_query_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_5_attention_self_key_bias = const()[name = string("model_encoder_layer_5_attention_self_key_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(21226176)))];
            tensor<fp32, [384, 384]> model_encoder_layer_5_attention_self_key_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(21227776))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(21375296))))[name = string("model_encoder_layer_5_attention_self_key_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_5_attention_self_value_bias = const()[name = string("model_encoder_layer_5_attention_self_value_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(21376896)))];
            tensor<fp32, [384, 384]> model_encoder_layer_5_attention_self_value_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(21378496))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(21526016))))[name = string("model_encoder_layer_5_attention_self_value_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_5_attention_output_dense_bias = const()[name = string("model_encoder_layer_5_attention_output_dense_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(21527616)))];
            tensor<fp32, [384, 384]> model_encoder_layer_5_attention_output_dense_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(21529216))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(21676736))))[name = string("model_encoder_layer_5_attention_output_dense_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_5_attention_output_LayerNorm_bias = const()[name = string("model_encoder_layer_5_attention_output_LayerNorm_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(21678336)))];
            tensor<fp32, [384]> model_encoder_layer_5_attention_output_LayerNorm_weight = const()[name = string("model_encoder_layer_5_attention_output_LayerNorm_weight"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(21679936)))];
            tensor<fp32, [1536]> model_encoder_layer_5_intermediate_dense_bias = const()[name = string("model_encoder_layer_5_intermediate_dense_bias"), val = tensor<fp32, [1536]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(21681536)))];
            tensor<fp32, [1536, 384]> model_encoder_layer_5_intermediate_dense_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [1536, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(21687744))), scale = tensor<fp32, [1536, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(22277632))))[name = string("model_encoder_layer_5_intermediate_dense_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_5_output_dense_bias = const()[name = string("model_encoder_layer_5_output_dense_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(22283840)))];
            tensor<fp32, [384, 1536]> model_encoder_layer_5_output_dense_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 1536]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(22285440))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(22875328))))[name = string("model_encoder_layer_5_output_dense_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_5_output_LayerNorm_bias = const()[name = string("model_encoder_layer_5_output_LayerNorm_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(22876928)))];
            tensor<fp32, [384]> model_encoder_layer_5_output_LayerNorm_weight = const()[name = string("model_encoder_layer_5_output_LayerNorm_weight"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(22878528)))];
            tensor<fp32, [384]> model_encoder_layer_6_attention_self_query_bias = const()[name = string("model_encoder_layer_6_attention_self_query_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(22880128)))];
            tensor<fp32, [384, 384]> model_encoder_layer_6_attention_self_query_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(22881728))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(23029248))))[name = string("model_encoder_layer_6_attention_self_query_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_6_attention_self_key_bias = const()[name = string("model_encoder_layer_6_attention_self_key_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(23030848)))];
            tensor<fp32, [384, 384]> model_encoder_layer_6_attention_self_key_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(23032448))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(23179968))))[name = string("model_encoder_layer_6_attention_self_key_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_6_attention_self_value_bias = const()[name = string("model_encoder_layer_6_attention_self_value_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(23181568)))];
            tensor<fp32, [384, 384]> model_encoder_layer_6_attention_self_value_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(23183168))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(23330688))))[name = string("model_encoder_layer_6_attention_self_value_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_6_attention_output_dense_bias = const()[name = string("model_encoder_layer_6_attention_output_dense_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(23332288)))];
            tensor<fp32, [384, 384]> model_encoder_layer_6_attention_output_dense_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(23333888))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(23481408))))[name = string("model_encoder_layer_6_attention_output_dense_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_6_attention_output_LayerNorm_bias = const()[name = string("model_encoder_layer_6_attention_output_LayerNorm_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(23483008)))];
            tensor<fp32, [384]> model_encoder_layer_6_attention_output_LayerNorm_weight = const()[name = string("model_encoder_layer_6_attention_output_LayerNorm_weight"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(23484608)))];
            tensor<fp32, [1536]> model_encoder_layer_6_intermediate_dense_bias = const()[name = string("model_encoder_layer_6_intermediate_dense_bias"), val = tensor<fp32, [1536]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(23486208)))];
            tensor<fp32, [1536, 384]> model_encoder_layer_6_intermediate_dense_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [1536, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(23492416))), scale = tensor<fp32, [1536, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(24082304))))[name = string("model_encoder_layer_6_intermediate_dense_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_6_output_dense_bias = const()[name = string("model_encoder_layer_6_output_dense_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(24088512)))];
            tensor<fp32, [384, 1536]> model_encoder_layer_6_output_dense_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 1536]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(24090112))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(24680000))))[name = string("model_encoder_layer_6_output_dense_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_6_output_LayerNorm_bias = const()[name = string("model_encoder_layer_6_output_LayerNorm_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(24681600)))];
            tensor<fp32, [384]> model_encoder_layer_6_output_LayerNorm_weight = const()[name = string("model_encoder_layer_6_output_LayerNorm_weight"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(24683200)))];
            tensor<fp32, [384]> model_encoder_layer_7_attention_self_query_bias = const()[name = string("model_encoder_layer_7_attention_self_query_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(24684800)))];
            tensor<fp32, [384, 384]> model_encoder_layer_7_attention_self_query_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(24686400))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(24833920))))[name = string("model_encoder_layer_7_attention_self_query_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_7_attention_self_key_bias = const()[name = string("model_encoder_layer_7_attention_self_key_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(24835520)))];
            tensor<fp32, [384, 384]> model_encoder_layer_7_attention_self_key_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(24837120))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(24984640))))[name = string("model_encoder_layer_7_attention_self_key_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_7_attention_self_value_bias = const()[name = string("model_encoder_layer_7_attention_self_value_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(24986240)))];
            tensor<fp32, [384, 384]> model_encoder_layer_7_attention_self_value_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(24987840))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(25135360))))[name = string("model_encoder_layer_7_attention_self_value_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_7_attention_output_dense_bias = const()[name = string("model_encoder_layer_7_attention_output_dense_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(25136960)))];
            tensor<fp32, [384, 384]> model_encoder_layer_7_attention_output_dense_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(25138560))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(25286080))))[name = string("model_encoder_layer_7_attention_output_dense_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_7_attention_output_LayerNorm_bias = const()[name = string("model_encoder_layer_7_attention_output_LayerNorm_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(25287680)))];
            tensor<fp32, [384]> model_encoder_layer_7_attention_output_LayerNorm_weight = const()[name = string("model_encoder_layer_7_attention_output_LayerNorm_weight"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(25289280)))];
            tensor<fp32, [1536]> model_encoder_layer_7_intermediate_dense_bias = const()[name = string("model_encoder_layer_7_intermediate_dense_bias"), val = tensor<fp32, [1536]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(25290880)))];
            tensor<fp32, [1536, 384]> model_encoder_layer_7_intermediate_dense_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [1536, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(25297088))), scale = tensor<fp32, [1536, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(25886976))))[name = string("model_encoder_layer_7_intermediate_dense_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_7_output_dense_bias = const()[name = string("model_encoder_layer_7_output_dense_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(25893184)))];
            tensor<fp32, [384, 1536]> model_encoder_layer_7_output_dense_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 1536]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(25894784))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(26484672))))[name = string("model_encoder_layer_7_output_dense_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_7_output_LayerNorm_bias = const()[name = string("model_encoder_layer_7_output_LayerNorm_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(26486272)))];
            tensor<fp32, [384]> model_encoder_layer_7_output_LayerNorm_weight = const()[name = string("model_encoder_layer_7_output_LayerNorm_weight"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(26487872)))];
            tensor<fp32, [384]> model_encoder_layer_8_attention_self_query_bias = const()[name = string("model_encoder_layer_8_attention_self_query_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(26489472)))];
            tensor<fp32, [384, 384]> model_encoder_layer_8_attention_self_query_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(26491072))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(26638592))))[name = string("model_encoder_layer_8_attention_self_query_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_8_attention_self_key_bias = const()[name = string("model_encoder_layer_8_attention_self_key_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(26640192)))];
            tensor<fp32, [384, 384]> model_encoder_layer_8_attention_self_key_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(26641792))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(26789312))))[name = string("model_encoder_layer_8_attention_self_key_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_8_attention_self_value_bias = const()[name = string("model_encoder_layer_8_attention_self_value_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(26790912)))];
            tensor<fp32, [384, 384]> model_encoder_layer_8_attention_self_value_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(26792512))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(26940032))))[name = string("model_encoder_layer_8_attention_self_value_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_8_attention_output_dense_bias = const()[name = string("model_encoder_layer_8_attention_output_dense_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(26941632)))];
            tensor<fp32, [384, 384]> model_encoder_layer_8_attention_output_dense_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [384, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(26943232))), scale = tensor<fp32, [384, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(27090752))))[name = string("model_encoder_layer_8_attention_output_dense_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_8_attention_output_LayerNorm_bias = const()[name = string("model_encoder_layer_8_attention_output_LayerNorm_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(27092352)))];
            tensor<fp32, [384]> model_encoder_layer_8_attention_output_LayerNorm_weight = const()[name = string("model_encoder_layer_8_attention_output_LayerNorm_weight"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(27093952)))];
            tensor<fp32, [1536]> model_encoder_layer_8_intermediate_dense_bias = const()[name = string("model_encoder_layer_8_intermediate_dense_bias"), val = tensor<fp32, [1536]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(27095552)))];
            tensor<fp32, [1536, 384]> model_encoder_layer_8_intermediate_dense_weight_quantized = constexpr_blockwise_shift_scale(data = tensor<int8, [1536, 384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(27101760))), scale = tensor<fp32, [1536, 1]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(27691648))))[name = string("model_encoder_layer_8_intermediate_dense_weight_quantized")];
            tensor<fp32, [384]> model_encoder_layer_8_output_dense_bias = const()[name = string("model_encoder_layer_8_output_dense_bias"), val = tensor<fp32, [384]>(BLOBFILE(path = string("@model_path/weights/weight.bin"), offset = uint64(27697856)))];
